rpc = "https://1rpc.io/arb"

random_wallets = False # Рандомизация кошельков True/False
random_enabled = True # Рандомный выбор варианта голосования True/False

sleep_wallet_from = 500
sleep_wallet_to = 2500


#-----------------------------------------------------------------------------------------------------------------------------------------------------------#
#      Treasury Governor - 0x789fc99093b09ad01c34dc7251d0c89ce743e5a4      ||           Core Governor - 0xf07DeD9dC292157749B6Fd268E37DF6EA38395B9          #
#-----------------------------------------------------------------------------------------------------------------------------------------------------------#


contract_address = "0x789fc99093b09ad01c34dc7251d0c89ce743e5a4" # Адресс контракта, Treasury Governor или Core Governor 
proposal_id = 21881347407562908848280051025758535553780110598432331587570488445729767071232  # id proposal

support = 0  # 1 для "For", 2 для "Abstain", 0 для "Against"
